test2.xml

<ns0:Envelope xmlns:ns0="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.plexus-online.com/DataSource"><ns0:Body><ns1:ExecuteDataSource><ns1:ExecuteDataSourceRequest><ns1:DataSourceKey>2272</ns1:DataSourceKey><ns1:InputParameters><ns1:InputParameter><ns1:Value>61324</ns1:Value><ns1:Name>Workcenter_Key</ns1:Name><ns1:Required>false</ns1:Required><ns1:Output>false</ns1:Output></ns1:InputParameter></ns1:InputParameters></ns1:ExecuteDataSourceRequest></ns1:ExecuteDataSource></ns0:Body></ns0:Envelope>